u-blox/ubxlib/port/platform/stm32cube/src/u_port_spi.c
/*
 * Copyright 2019-2024 u-blox
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/** @file
 * @brief Implementation of the port SPI API for the STM32 platform.
 */

#include "stddef.h"
#include "stdint.h"
#include "stdbool.h"
#include "string.h"   // memset()

#include "u_cfg_sw.h"
#include "u_cfg_hw_platform_specific.h"
#include "u_compiler.h" // U_ATOMIC_XXX() macros

#include "u_error_common.h"
#include "u_port.h"
#include "u_port_os.h"
#include "u_port_spi.h"

#ifdef STM32U575xx
# include "stm32u5xx_ll_bus.h"
# include "stm32u5xx_ll_rcc.h"
# include "stm32u5xx_ll_gpio.h"
# include "stm32u5xx_ll_spi.h"
# include "stm32u5xx_hal_spi.h"
#else
# include "stm32f4xx_ll_bus.h"
# include "stm32f4xx_ll_rcc.h"
# include "stm32f4xx_ll_gpio.h"
# include "stm32f4xx_ll_spi.h"
# include "stm32f4xx_hal_spi.h"
#endif

#include "u_port_private.h"      // Down here 'cos it needs GPIO_TypeDef

/* This code uses the LL API as otherwise we have to keep
 * an entire structure of type SPI_HandleTypeDef in memory
 * for no very good reason.
 */

/* ----------------------------------------------------------------
 * COMPILE-TIME MACROS
 * -------------------------------------------------------------- */

#ifndef U_PORT_SPI_MAX_NUM
/** The number of SPI HW blocks that are available; there can be up
 * to six SPI controllers.
 */
# define U_PORT_SPI_MAX_NUM 6
#endif

/* ----------------------------------------------------------------
 * TYPES
 * -------------------------------------------------------------- */

/** The types of SPI pin.
 */
typedef enum {
    U_PORT_SPI_PIN_TYPE_MOSI,
    U_PORT_SPI_PIN_TYPE_MISO,
    U_PORT_SPI_PIN_TYPE_CLK,
    U_PORT_SPI_PIN_TYPE_SELECT
} uPortSpiPinType_t;

/** Structure of the things we need to keep track of per SPI instance.
 */
typedef struct {
    SPI_TypeDef *pReg; // Set to NULL if this entry is not in use
    int32_t pinMosi;
    int32_t pinMiso;
    int32_t pinSelect;
    uint16_t fillWord;
} uPortSpiData_t;

/* ----------------------------------------------------------------
 * VARIABLES
 * -------------------------------------------------------------- */

/** Mutex to ensure thread-safety.
 */
static uPortMutexHandle_t gMutex = NULL;

/** Table of the HW addresses for each SPI block.
 */
static SPI_TypeDef *const gpSpiReg[] = {NULL,  // This to avoid having to -1
                                        SPI1,
                                        SPI2,
                                        SPI3,
#ifndef STM32U575xx
                                        SPI4,
                                        SPI5,
                                        SPI6
#endif
                                       };

/** Storage for the SPI instances.
 */
static uPortSpiData_t gSpiData[U_PORT_SPI_MAX_NUM + 1]; // +1 to avoid having to -1

/** Variable to keep track of the number of SPI interfaces open.
 */
static volatile int32_t gResourceAllocCount = 0;

/* ----------------------------------------------------------------
 * STATIC FUNCTIONS
 * -------------------------------------------------------------- */

// Get the SPI number from a register address.
static int32_t getSpi(const SPI_TypeDef *pReg)
{
    int32_t errorCodeOrSpi = (int32_t) U_ERROR_COMMON_INVALID_PARAMETER;

    // Start at 1 below 'cos the first entry in gpI2cReg is empty
    for (size_t x = 1; (x < sizeof(gpSpiReg) / sizeof (gpSpiReg[0])) &&
         (errorCodeOrSpi < 0); x++) {
        if (gpSpiReg[x] == pReg) {
            errorCodeOrSpi = x;
        }
    }

    return errorCodeOrSpi;
}

// Enable clock to an SPI block; these are macros so can't be
// entries in a table.
static int32_t clockEnable(const SPI_TypeDef *pReg)
{
    int32_t errorCodeOrSpi = getSpi(pReg);

    switch (errorCodeOrSpi) {
        case 1:
            __HAL_RCC_SPI1_CLK_ENABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 2:
            __HAL_RCC_SPI2_CLK_ENABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 3:
            __HAL_RCC_SPI3_CLK_ENABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
#ifndef STM32U575xx
        case 4:
            __HAL_RCC_SPI4_CLK_ENABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 5:
            __HAL_RCC_SPI5_CLK_ENABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 6:
            __HAL_RCC_SPI6_CLK_ENABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
#endif
        default:
            break;
    }

    return errorCodeOrSpi;
}

// Disable clock to an SPI block; these are macros so can't be
// entries in a table.
static int32_t clockDisable(const SPI_TypeDef *pReg)
{
    int32_t errorCodeOrSpi = getSpi(pReg);

    switch (errorCodeOrSpi) {
        case 1:
            __HAL_RCC_SPI1_CLK_DISABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 2:
            __HAL_RCC_SPI2_CLK_DISABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 3:
            __HAL_RCC_SPI3_CLK_DISABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
#ifndef STM32U575xx
        case 4:
            __HAL_RCC_SPI4_CLK_DISABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 5:
            __HAL_RCC_SPI5_CLK_DISABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
        case 6:
            __HAL_RCC_SPI6_CLK_DISABLE();
            errorCodeOrSpi = (int32_t) U_ERROR_COMMON_SUCCESS;
            break;
#endif
        default:
            break;
    }

    return errorCodeOrSpi;
}

// Get the peripheral clock for the given SPI.
static uint32_t getPeripheralClock(const SPI_TypeDef *pReg)
{
    uint32_t clock = LL_RCC_PERIPH_FREQUENCY_NO;
    LL_RCC_ClocksTypeDef rccClocks;

    LL_RCC_GetSystemClocksFreq(&rccClocks);
    // From figure 4 of the STM32F437 data sheet
    switch (getSpi(pReg)) {
        case 1:
            clock = rccClocks.PCLK2_Frequency;
            break;
        case 2:
            clock = rccClocks.PCLK1_Frequency;
            break;
        case 3:
            clock = rccClocks.PCLK1_Frequency;
            break;
#ifndef STM32U575xx
        case 4:
            clock = rccClocks.PCLK2_Frequency;
            break;
        case 5:
            clock = rccClocks.PCLK2_Frequency;
            break;
        case 6:
            clock = rccClocks.PCLK2_Frequency;
            break;
#endif
        default:
            break;
    }

    return clock;
}

// Get a power-of-two divisor for the APB frequency to
// achieve at or less than the desired SPI frequency.
static int32_t getPowerOfTwoDivisor(uint32_t apbFrequencyHertz, int32_t frequencyHertz)
{
    int32_t shift = 0;
    uint32_t result;

    do {
        result = apbFrequencyHertz >> shift;
        shift++;
    }  while (result > (uint32_t) frequencyHertz);
    shift--;

